Revit 2027 API
FabricArea.GetFabricSheetElementIds Method
 Retrieves the identifiers of all the FabricSheet Elements in the FabricArea.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetFabricSheetElementIds()
Public Function GetFabricSheetElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetFabricSheetElementIds()
member GetFabricSheetElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 A collection of ElementIds of FabricSheet elements.
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace